RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_mpu.c
/*******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 */
/******************************************************************************/
/** \file hc32f460_mpu.c
 **
 ** A detailed description is available at
 ** @link MpuGroup MPU description @endlink
 **
 **   - 2018-10-20 CDT First version for Device Driver Library of MPU.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f460_mpu.h"
#include "hc32f460_utility.h"

#if (DDL_MPU_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup MpuGroup
 ******************************************************************************/

//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/*!< Parameter valid check for MPU region number. */
#define IS_VALID_MPU_REGION_NUM(x)                                             \
(   (MpuRegionNum0  == (x))                 ||                                 \
    (MpuRegionNum1  == (x))                 ||                                 \
    (MpuRegionNum2  == (x))                 ||                                 \
    (MpuRegionNum3  == (x))                 ||                                 \
    (MpuRegionNum4  == (x))                 ||                                 \
    (MpuRegionNum5  == (x))                 ||                                 \
    (MpuRegionNum6  == (x))                 ||                                 \
    (MpuRegionNum7  == (x))                 ||                                 \
    (MpuRegionNum8  == (x))                 ||                                 \
    (MpuRegionNum9  == (x))                 ||                                 \
    (MpuRegionNum10 == (x))                 ||                                 \
    (MpuRegionNum11 == (x))                 ||                                 \
    (MpuRegionNum12 == (x))                 ||                                 \
    (MpuRegionNum13 == (x))                 ||                                 \
    (MpuRegionNum14 == (x))                 ||                                 \
    (MpuRegionNum15 == (x)))

/*!< Parameter valid check for MPU region size. */
#define IS_VALID_MPU_REGION_SIZE(x)                                            \
(   (MpuRegionSize32Byte   == (x))          ||                                 \
    (MpuRegionSize64Byte   == (x))          ||                                 \
    (MpuRegionSize128Byte  == (x))          ||                                 \
    (MpuRegionSize256Byte  == (x))          ||                                 \
    (MpuRegionSize512Byte  == (x))          ||                                 \
    (MpuRegionSize1KByte   == (x))          ||                                 \
    (MpuRegionSize2KByte   == (x))          ||                                 \
    (MpuRegionSize4KByte   == (x))          ||                                 \
    (MpuRegionSize8KByte   == (x))          ||                                 \
    (MpuRegionSize16KByte  == (x))          ||                                 \
    (MpuRegionSize32KByte  == (x))          ||                                 \
    (MpuRegionSize64KByte  == (x))          ||                                 \
    (MpuRegionSize128KByte == (x))          ||                                 \
    (MpuRegionSize256KByte == (x))          ||                                 \
    (MpuRegionSize512KByte == (x))          ||                                 \
    (MpuRegionSize1MByte   == (x))          ||                                 \
    (MpuRegionSize2MByte   == (x))          ||                                 \
    (MpuRegionSize4MByte   == (x))          ||                                 \
    (MpuRegionSize8MByte   == (x))          ||                                 \
    (MpuRegionSize16MByte  == (x))          ||                                 \
    (MpuRegionSize32MByte  == (x))          ||                                 \
    (MpuRegionSize64MByte  == (x))          ||                                 \
    (MpuRegionSize128MByte == (x))          ||                                 \
    (MpuRegionSize256MByte == (x))          ||                                 \
    (MpuRegionSize512MByte == (x))          ||                                 \
    (MpuRegionSize1GByte   == (x))          ||                                 \
    (MpuRegionSize2GByte   == (x))          ||                                 \
    (MpuRegionSize4GByte   == (x)))

/*!< Parameter valid check for MPU region type. */
#define IS_VALID_MPU_REGION_TYPE(x)                                            \
(   (SMPU1Region == (x))                    ||                                 \
    (SMPU2Region == (x))                    ||                                 \
    (FMPURegion  == (x)))

/*!< Parameter valid check for MPU action. */
#define IS_VALID_MPU_ACTION(x)                                                 \
(   (MpuTrigNmi      == (x))                ||                                 \
    (MpuTrigReset    == (x))                ||                                 \
    (MpuNoneAction   == (x))                ||                                 \
    (MpuTrigBusError == (x)))

/******************************************************************************/
/*                                     MPU                                    */
/******************************************************************************/
/*!< Get the RGD register address of the specified MPU region */
#define MPU_RGDx(__REGION_NUM__)            ((uint32_t)(&M4_MPU->RGD0) + ((uint32_t)(__REGION_NUM__)) * 4u)

/*!< Get the RGCR register address of the specified MPU region */
#define MPU_RGCRx(__REGION_NUM__)           ((uint32_t)(&M4_MPU->RGCR0) + ((uint32_t)(__REGION_NUM__)) * 4u)

