RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_mpu.c
        /* Set SMPU1 */
        M4_MPU->CR_f.SMPU1BWP = (pstcInitCfg->stcSMPU1BkgdPermission.enWriteEnable) ? 0ul : 1ul;
        M4_MPU->CR_f.SMPU1BRP = (pstcInitCfg->stcSMPU1BkgdPermission.enReadEnable) ? 0ul : 1ul;

        /* Set SMPU2 */
        M4_MPU->CR_f.SMPU2BWP = (pstcInitCfg->stcSMPU2BkgdPermission.enWriteEnable) ? 0ul : 1ul;
        M4_MPU->CR_f.SMPU2BRP = (pstcInitCfg->stcSMPU2BkgdPermission.enReadEnable) ? 0ul : 1ul;

        /* Set FMPU */
        M4_MPU->CR_f.FMPUBWP = (pstcInitCfg->stcFMPUBkgdPermission.enWriteEnable) ? 0ul : 1ul;
        M4_MPU->CR_f.FMPUBRP = (pstcInitCfg->stcFMPUBkgdPermission.enReadEnable) ? 0ul : 1ul;

        /* Recover write protection of MPU register */
        M4_MPU->WP = (MPU_WRITE_PROT_KEY | u32WriteProt);
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set MPU size of the specified region.
 **
 ** \param [in] enRegionNum             MPU region number
 ** \arg This parameter can be a value of @ref en_mpu_region_num_t
 ** \param [in] enRegionSize            MPU region size
 ** \arg This parameter can be a value of @ref en_mpu_region_size_t
 **
 ** \retval Ok                          Set successfully.
 **
 ******************************************************************************/
en_result_t MPU_SetRegionSize(en_mpu_region_num_t enRegionNum,
                                en_mpu_region_size_t enRegionSize)
{
    stc_mpu_rgd0_field_t *RGD_f = NULL;

    DDL_ASSERT(IS_VALID_MPU_REGION_NUM(enRegionNum));
    DDL_ASSERT(IS_VALID_MPU_REGION_SIZE(enRegionSize));

    RGD_f = (stc_mpu_rgd0_field_t *)MPU_RGDx(enRegionNum);
    RGD_f->MPURG0SIZE = (uint32_t)enRegionSize;

    return Ok;
}

/**
 *******************************************************************************
 ** \brief Get MPU size of the specified region.
 **
 ** \param [in] enRegionNum             MPU region number
 ** \arg This parameter can be a value of @ref en_mpu_region_num_t
 **
 ** \retval MPU size of the specified region.
 **
 ******************************************************************************/
en_mpu_region_size_t MPU_GetRegionSize(en_mpu_region_num_t enRegionNum)
{
    stc_mpu_rgd0_field_t *RGD_f = NULL;

    DDL_ASSERT(IS_VALID_MPU_REGION_NUM(enRegionNum));

    RGD_f = (stc_mpu_rgd0_field_t *)MPU_RGDx(enRegionNum);

    return (en_mpu_region_size_t)(RGD_f->MPURG0SIZE);
}

/**
 *******************************************************************************
 ** \brief Set MPU base address of the specified region.
 **
 ** \param [in] enRegionNum             MPU region number
 ** \arg This parameter can be a value of @ref en_mpu_region_num_t
 ** \param [in] u32RegionBaseAddr       the specified base address
 **
 ** \retval Ok                          Set successfully.
 **
 ******************************************************************************/
en_result_t MPU_SetRegionBaseAddress(en_mpu_region_num_t enRegionNum,
                                uint32_t u32RegionBaseAddr)
{
    stc_mpu_rgd0_field_t *RGD_f = NULL;

    DDL_ASSERT(IS_VALID_MPU_REGION_NUM(enRegionNum));

    RGD_f = (stc_mpu_rgd0_field_t *)MPU_RGDx(enRegionNum);
    RGD_f->MPURG0ADDR = (u32RegionBaseAddr >> MPU_RGD_RGADDR_Pos);

    return Ok;
}

/**
 *******************************************************************************
 ** \brief Get MPU base address of the specified region.
 **
 ** \param [in] enRegionNum             MPU region number
 ** \arg This parameter can be a value of @ref en_mpu_region_num_t
s **
 ** \retval MPU base address of the specified region.
 **
 ******************************************************************************/
uint32_t MPU_GetRegionBaseAddress(en_mpu_region_num_t enRegionNum)
{
    stc_mpu_rgd0_field_t *RGD_f = NULL;

    DDL_ASSERT(IS_VALID_MPU_REGION_NUM(enRegionNum));

    RGD_f = (stc_mpu_rgd0_field_t *)MPU_RGDx(enRegionNum);

    return (RGD_f->MPURG0ADDR << MPU_RGD_RGADDR_Pos);
}

/**
 *******************************************************************************
 ** \brief Set the action of the specified MPU region type.
 **
 ** \param [in] enMpuRegionType         the specified region type
 ** \arg SMPU1Region                    System DMA_1 MPU
 ** \arg SMPU2Region                    System DMA_2 MPU
 ** \arg FMPURegion                     System USBFS_DMA MPU
 ** \param [in] enActionSel             MPU action
 ** \arg MpuNoneAction                  MPU don't action.
 ** \arg MpuTrigBusError                MPU trigger bus error
 ** \arg MpuTrigNmi                     MPU trigger bus NMI interrupt
 ** \arg MpuTrigReset                   MPU trigger reset
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - enActionSel is invalid
 **
 ******************************************************************************/
en_result_t MPU_SetNoPermissionAcessAction(en_mpu_region_type_t enMpuRegionType,
                                en_mpu_action_sel_t enActionSel)
{
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_MPU_ACTION(enActionSel));
    DDL_ASSERT(IS_VALID_MPU_REGION_TYPE(enMpuRegionType));

    switch (enMpuRegionType)
    {
        case SMPU1Region:
            M4_MPU->CR_f.SMPU1ACT = (uint32_t)enActionSel;
            break;
        case SMPU2Region:
            M4_MPU->CR_f.SMPU2ACT = (uint32_t)enActionSel;
            break;
        case FMPURegion:
            M4_MPU->CR_f.FMPUACT = (uint32_t)enActionSel;
            break;
        default:
            enRet = ErrorInvalidParameter;
            break;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get the action of the specified MPU region type.
 **
 ** \param [in] enMpuRegionType         the specified region type
 ** \arg SMPU1Region                    System DMA_1 MPU
 ** \arg SMPU2Region                    System DMA_2 MPU
 ** \arg FMPURegion                     System USBFS_DMA MPU
 **
 ** \retval MpuNoneAction               MPU don't action.
 ** \retval MpuTrigBusError             MPU trigger bus error
 ** \retval MpuTrigNmi                  MPU trigger bus NMI interrupt
 ** \retval MpuTrigReset                MPU trigger reset
 **
 ******************************************************************************/
en_mpu_action_sel_t MPU_GetNoPermissionAcessAction(en_mpu_region_type_t enMpuRegionType)
{
    uint32_t u32ActionSel = 0u;

