RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_mpu.c
    switch (enMpuRegionType)
    {
        case SMPU1Region:
            M4_MPU->CR_f.SMPU1BRP = ((Enable == enState) ? 0ul : 1ul);
            break;
        case SMPU2Region:
            M4_MPU->CR_f.SMPU2BRP = ((Enable == enState) ? 0ul : 1ul);
            break;
        case FMPURegion:
            M4_MPU->CR_f.FMPUBRP = ((Enable == enState) ? 0ul : 1ul);
            break;
        default:
            enRet = ErrorInvalidParameter;
            break;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get MPU read permission of the specified background region and enMpuRegionType.
 **
 ** \param [in] enMpuRegionType         MPU region type
 ** \arg SMPU1Region                    System DMA_1 MPU
 ** \arg SMPU2Region                    System DMA_2 MPU
 ** \arg FMPURegion                     System USBFS_DMA MPU
 **
 ** \retval Enable                      Enable the specified MPU region read permission
 ** \retval Disable                     Disable the specified MPU region read permission
 **
 ******************************************************************************/
en_functional_state_t MPU_GetBkgdRegionReadPermission(en_mpu_region_type_t enMpuRegionType)
{
    uint32_t u32State = 0u;

    DDL_ASSERT(IS_VALID_MPU_REGION_TYPE(enMpuRegionType));

    switch (enMpuRegionType)
    {
        case SMPU1Region:
            u32State = M4_MPU->CR_f.SMPU1BRP;
            break;
        case SMPU2Region:
            u32State = M4_MPU->CR_f.SMPU2BRP;
            break;
        case FMPURegion:
            u32State = M4_MPU->CR_f.FMPUBRP;
            break;
        default:
            break;
    }

    return (u32State ? Disable : Enable);
}

/**
 *******************************************************************************
 ** \brief Set MPU write permission of the specified background region and enMpuRegionType.
 **
 ** \param [in] enMpuRegionType         MPU region type
 ** \arg SMPU1Region                    System DMA_1 MPU
 ** \arg SMPU2Region                    System DMA_2 MPU
 ** \arg FMPURegion                     System USBFS_DMA MPU
 ** \param [in] enState                 MPU region state
 ** \arg Enable                         Enable the specified MPU region write permission
 ** \arg Disable                        Disable the specified MPU region write permission
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       enMpuRegionType is invalid
 **
 ******************************************************************************/
en_result_t MPU_SetBkgdRegionWritePermission(en_mpu_region_type_t enMpuRegionType,
                                en_functional_state_t enState)
{
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enState));
    DDL_ASSERT(IS_VALID_MPU_REGION_TYPE(enMpuRegionType));

    switch (enMpuRegionType)
    {
        case SMPU1Region:
            M4_MPU->CR_f.SMPU1BWP = ((Enable == enState) ? 0ul : 1ul);
            break;
        case SMPU2Region:
            M4_MPU->CR_f.SMPU2BWP = ((Enable == enState) ? 0ul : 1ul);
            break;
        case FMPURegion:
            M4_MPU->CR_f.FMPUBWP = ((Enable == enState) ? 0ul : 1ul);
            break;
        default:
            enRet = ErrorInvalidParameter;
            break;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get MPU write permission of the specified background region and enMpuRegionType.
 **
 ** \param [in] enMpuRegionType         MPU region type
 ** \arg SMPU1Region                    System DMA_1 MPU
 ** \arg SMPU2Region                    System DMA_2 MPU
 ** \arg FMPURegion                     System USBFS_DMA MPU
 **
 ** \retval Enable                      Enable the specified MPU region read permission
 ** \retval Disable                     Disable the specified MPU region read permission
 **
 ******************************************************************************/
en_functional_state_t MPU_GetBkgdRegionWritePermission(en_mpu_region_type_t enMpuRegionType)
{
    uint32_t u32State = 0u;

    DDL_ASSERT(IS_VALID_MPU_REGION_TYPE(enMpuRegionType));

    switch (enMpuRegionType)
    {
        case SMPU1Region:
            u32State = M4_MPU->CR_f.SMPU1BWP;
            break;
        case SMPU2Region:
            u32State = M4_MPU->CR_f.SMPU2BWP;
            break;
        case FMPURegion:
            u32State = M4_MPU->CR_f.FMPUBWP;
            break;
        default:
            break;
    }

    return (u32State ? Disable : Enable);
}

/**
 *******************************************************************************
 ** \brief Set MPU function of the specified region and type.
 **
 ** \param [in] enState                 MPU write protection state
 ** \arg Enable                         Enable the write protection function
 ** \arg Disable                        Disable the write protection function
 **
 ** \retval Ok                          Set successfully.
 **
 ******************************************************************************/
en_result_t MPU_WriteProtCmd(en_functional_state_t enState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enState));

    M4_MPU->WP = (MPU_WRITE_PROT_KEY | ((Enable == enState) ? 0ul : 1ul));

    return Ok;
}

/**
 *******************************************************************************
 ** \brief Enable the specified IP Write/Read protection.
 **
 ** \param [in] u32ProtMode             Ip protection mode
 ** \arg AesReadProt                    AES read protection
 ** \arg AesWriteProt                   AES write protection
 ** \arg HashReadProt                   HASH read protection
 ** \arg HashWriteProt                  HASH write protection
 ** \arg TrngReadProt                   TRNG read protection
 ** \arg TrngWriteProt                  TRNG write protection
 ** \arg CrcReadProt                    CRC read protection
 ** \arg CrcWriteProt                   CRC write protection
 ** \arg FmcReadProt                    FMC read protection
 ** \arg FmcWriteProt                   FMC write protection
 ** \arg WdtReadProt                    WDT read protection
 ** \arg WdtWriteProt                   WDT write protection
 ** \arg SwdtReadProt                   WDT read protection
 ** \arg SwdtWriteProt                  WDT write protection
 ** \arg BksramReadProt                 BKSRAM read protection
 ** \arg BksramWriteProt                BKSRAM write protection
 ** \arg RtcReadProt                    RTC read protection
 ** \arg RtcWriteProt                   RTC write protection
 ** \arg DmpuReadProt                   DMPU read protection
 ** \arg DmpuWriteProt                  DMPU write protection
 ** \arg SramcReadProt                  SRAMC read protection
 ** \arg SramcWriteProt                 SRAMC write protection
 ** \arg IntcReadProt                   INTC read protection
 ** \arg IntcWriteProt                  INTC write protection
 ** \arg SyscReadProt                   SYSC read protection
 ** \arg SyscWriteProt                  SYSC write protection
 ** \arg MstpWriteProt                  MSTP write protection
 ** \arg MstpWriteProt                  MSTP write protection
 ** \arg BusErrProt                     BUSERR write protection
 ** \param [in] enState                 MPU IP protection state
 ** \arg Enable                         Enable the IP protection function
 ** \arg Disable                        Disable the IP protection function
 **
 ** \retval Ok                          Set successfully.
 **
 ******************************************************************************/
en_result_t MPU_IpProtCmd(uint32_t u32ProtMode,
                                en_functional_state_t enState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enState));

    if(Enable == enState)
    {
        M4_SYSREG->MPU_IPPR |= u32ProtMode;
    }
    else
    {
        M4_SYSREG->MPU_IPPR &= (~u32ProtMode);
    }

    return Ok;
}

//@} // MpuGroup

#endif /* DDL_MPU_ENABLE */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
